TargetApplication=DKLang Translation Editor 3.0
Author=Maroš Šušla, majsus
SourceLANGID=1033
LANGID=1051
Generator=DKLang Translation Editor v3.0
LastModified=2010-04-25 19:20:18

[dAbout]
00000001=O
00000004=Internet:
00000005=OK
00000006=Kontaktný e-mail

[dDiffLog]
00000001=Zistené rozdiely
00000002=Zatvoriť
00000003=Súčty
00000004=&Automaticky prekladať všetky nepreložené položky pomocou
00000005=Pomoc

[dFind]
00000001=Nájsť alebo Nahradiť
00000003=Zatvoriť
00000004=&Hľadať:
00000006=Možnosti
00000007=&Veľké a malé písmená
00000008=&Len celé slová
00000010=Hľadať iba vy&brané
00000011=Zdroj
00000012=Od za&meraného vstupu\n&Celý priestor\n
00000013=Smer
00000014=&Dopredu\n&Dozadu\n
00000015=Nahradiť &riadok
00000016=N&ahradiť všetko
00000017=&Nahraďte:
00000018=Rozsah
00000019=Vyhľadávanie vstupných &názvov
00000020=Hľadať &originálne hodnoty
00000021=Hľadať &preložené hodnoty
00000022=Pomoc

[dOpenFiles]
00000001=Otvoriť jazykové súbory
00000002=&Jazykový zdrojový súbor:
00000003=&Prehliadať...
00000004=Pre&hliadať...
00000005=Pr&ehliadať...
00000006=&Použite nasledujúci súbor pre preklad pre zobrazenie hodnoty (namiesto tých zo zdrojového súboru):
00000007=&Vytvoriť nový preklad
00000008=&Otvorte existujúci súbor pre preklad
00000009=OK
00000010=Zrušiť
00000011=Pomoc

[dPromptReplace]
00000001=Potvrdiť nahradenie
00000009=Án&o
00000010=Zrušiť
00000012=Nahradiť &všetko
00000013=&Nie
00000014=Pomoc

[dSettings]
00000001=Nastavenia programu
00000002=OK
00000003=Zrušiť
00000005=&Cesta zdroja prekladu:
00000006=(V tomto prípade budete musieť priradiť skratky neskôr ručne)
00000007=P&rehliadať...
00000008=&Odstrániť prefix znak ('&&'), pri pridaní reťazca na zdroj
00000009=&Automaticky pridávať nové preklady do zdroja
00000013=Pí&smo rozhrania...
00000014=&Písmo v tabuľke...
00000015=Nepoužívajte &varovanie k jazyku zdroja ak preklady boli uložené rôznym kódovaním
00000016=Zdroj
00000017=Rozhranie
00000018=Pomoc

[dTranProps]
00000001=Vlastnosti prekladu
00000002=&Zdrojový jazyk (používa sa pre preklady zdroja):
00000003=&Jazyk prekladu:
00000004=&Autor:
00000005=Ďalšie parametre (vo formáte 'názov = ho&dnota'):
00000006=&Cieľová aplikácia/Verzia:
00000007=OK
00000008=Zrušiť
00000009=Pomoc

[fMain]
00000002=Hlavné menu
00000003=&Súbor
00000004=&Upraviť
00000005=&Zobrazenie
00000006=&Panel nástrojov
00000007=Zobraziť / skryť panel nástrojov
00000008=Aktuálne zdrojové &vstupy
00000009=Zobraziť / skryť vstup aktuálneho zdrojového panela
00000010=&Stavový riadok
00000011=Zobraziť / skryť stavový riadok
00000012=&Jazyk
00000013=&Nástroje
00000014=&Pomoc
00000015=Panel nástrojov
00000018=Celkový počet komponentov záznamov
00000020=Počet zložiek komponentu položiek celkom / nepreložené
00000022=Počet stálych položiek celkom / nepreložené
00000024=Počet záznamov zdroja
00000025=Súbor
00000026=&Nový alebo Otvoriť...
00000027=Nový alebo Otvoriť...|Vytvoriť nový preklad, alebo otvoriť existujúci
00000028=Súbor
00000029=&Uložiť
00000030=Uložiť|Uložiť aktuálne preklady
00000031=Súbor
00000032=Uložiť &ako...
00000033=Uložiť ako...|Uložiť aktuálny preklad do iného súboru
00000034=Súbor
00000035=&Zatvoriť
00000036=Zatvoriť|Zatvorte otvorené súbory
00000037=Súbor
00000038=&Ukončiť
00000039=Ukončiť|Ukončiť program
00000040=Nástroje
00000041=&Programové nastavenia...
00000042=Programové nastavenia...|Zobraziť alebo zmeniť nastavenia programu
00000043=Pomoc
00000044=&O...
00000045=O...|Info o verzii a autorských právach
00000046=Upraviť
00000047=Prejsť na predchádzajúci nepreložený &vstup
00000048=Prejsť na predchádzajúci nepreložený alebo autopreložený vstup
00000049=Upraviť
00000050=Prej&sť na ďaľší nepreložený vstup
00000051=Prejsť na ďaľší nepreložený alebo autopreložený vstup
00000058=Upraviť
00000059=&Vlastnosti prekladu...
00000060=Vlastnosti prekladu...|Zobraziť alebo zmeniť vlastnosti prekladu
00000064=Nástroje
00000065=A&utomatický preklad vybraných
00000066=Automatický preklad vybraných|Automatický preklad nepreložených položiek aktuálne vybratých s použitím prekladu zdroja
00000067=Nástroje
00000068=Pridať do vybraného zd&roja
00000069=Pridať do vybraného zdroja|Pridať vybrané položky do zdroja prekladu
00000073=Pomoc
00000074=Hľadať akt&ualizácie
00000075=Hľadať aktualizácie|Vyhľadať aktualizácie programu na webe
00000076=Pomoc
00000077=DKLang Translation Editor do&movská stránka
00000078=DKLang Translation Editor domovská stránka|Program otvorí domovskú stránku v prehliadači
00000079=Pomoc
00000080=Produkt &podpora
00000081=Podpora produktu|Otvorí stránku podpory produktu v prehliadači
00000082=Pomoc
00000083=DK Software &Webová stránka
00000084=DK Software Webová stránka|Otvorí domovskú stránku autora v prehliadači
00000087=&Internet
00000088=Upraviť
00000089=P&repne zameranie
00000090=Prepnúť zameranie|Prepínač zameranie medzi tabuľkou a preloženou hodnotou editora
00000091=Upraviť
00000092=Predchádzajúci &záznam
00000093=Predchádzajúci záznam|Prejsť na predchádzajúci záznam
00000094=Upraviť
00000095=&Ďalší záznam
00000096=Ďalší záznam|prejsť na ďaľší záznam
00000097=Vlastnosti vstupu
00000098=Aktuálne vstupy zdroja
00000099=Aktuálne vstupy prekladu
00000100=&Nepreložené
00000101=Vstupné štatúty
00000102=&Autoprekladanie
00000103=&Vlastnosti vstupu
00000104=Aktuálne p&rekladaný vstup
00000105=Zložka / Vlastnosť / Konštanta
00000106=ID
00000107=Predvolená hodnota
00000108=Preložená hodnota
00000109=Upraviť
00000110=&Hľadať...
00000111=Hľadať...|Vyhľadávanie položiek pomocou určitého typu
00000112=Upraviť
00000113=Hľadať ďa&lej
00000114=Hľadať ďalej|Nájsť ďaľší výskyt reťazca
00000115=Upraviť
00000116=&Nahradiť...
00000117=Nahradiť...|Nahradenie jedného reťazca s ďaľším
00000118=Záložky
00000119=Zobraziť/skryť aktuálne preložený vstupný panel
00000120=Zobraziť/skryť vlastnosti vstupného panela
00000121=&Záložky
00000122=Ukázať/skryť panel záložiek
00000123=Upraviť
00000124=Prid&ať záložku
00000125=Pridať záložku|Pridať aktuálny záznam do zoznamu záložiek
00000126=Upraviť
00000127=&Zmazať záložku
00000128=Zmazať záložku|Odstránenie aktuálne vybratej záložky
00000129=Upraviť
00000130=&Prejsť na záložky
00000131=Prejsť na záložku|Prejsť na záložku aktuálne vybratej v záložke okna
00000132=Panel záložiek
00000133=Upraviť
00000134=&Kopírovať
00000135=Upraviť
00000136=&Vložiť
00000137=Upraviť
00000138=Vystrihn&úť
00000139=Kopírovať|Kopírovať vybraný text do schránky
00000140=Vložiť|Vložiť text zo schránky
00000141=Vystrihnúť|Vystrihnúť vybraný text do schránky
00000142=Pomoc
00000143=&Pomoc
00000144=Pomoc|Zobraziť pomoc programu

[$CONSTANTS]
SBtn_Find=Hľadať
SBtn_Replace=Nahradiť
SConfirm_FileNotSaved=Preklad súboru "% s" sa mení, ale nie je uložený. Prajete si ho uložiť?
SDiffDesc_AddComponent=+ Zložka: [%s]
SDiffDesc_AddConstant=+ Konštanta "%s"
SDiffDesc_AddProperty=+ Vlastnosť "%s" (ID=%d)
SDiffDesc_ExcessiveEntries=Tieto záznamy boli zistené ako nadbytočné a odstránené z prekladu:
SDiffDesc_MissingEntries=Tieto položky sa nenašli a boli pridané k prekladu:
SDiffDesc_RemoveComponent=- Zložka: [%s]
SDiffDesc_RemoveConstant=- Konštanta "%s"
SDiffDesc_RemoveProperty=- Zložka "%y", vlastnosť ID=%d
SDiffTotalsText=\tZložky\tVlastnosti\tKonštanty\nPridané\t%d\t%d\t%d\nOdstránené\t%d\t%d\t%d\nSpolu\t%d\t%d\t%d
SDlgTitle_Confirm=Potvrdiť
SDlgTitle_Error=Chyba
SDlgTitle_Info=Info
SDlgTitle_SaveTranFileAs=Vyberte preklad súboru pre uloženie
SDlgTitle_SelectDisplayFile=Vyberte súbor pre preklad použitý pre zobrazenie
SDlgTitle_SelectLangSourceFile=Vyberte jazyk zdrojového súboru
SDlgTitle_SelectTranFile=Vyberte súbor s prekladom
SDlgTitle_SelReposPath=Vyberte cestu prekladu zdroja:
SErrMsg_CharMissing="%s" chýba
SErrMsg_ConstNameMissing=Konštantný názov chýba
SErrMsg_DuplicateCompName=Duplicitné názvy zložky: "%s"
SErrMsg_DuplicatePropID=Duplicitné vlastnosti ID: %d
SErrMsg_DuplicatePropName=Duplicitné vlastnosti názov: "%s"
SErrMsg_FileDoesntExist=Súbor "%s" neexistuje
SErrMsg_InvalidCompName=Neplatný názov zložky: "%s"
SErrMsg_LoadLangSourceFailed=Chyba pri načítaní jazykového zdroja:\nRiadok %d: %s
SErrMsg_PropIDInvalid=Neplatná vlastnosť ID
SErrMsg_PropIDMissing=Chýbajúce ID vlastnosti
SErrMsg_PropNameMissing=Chýbajúci názov vlastnosti
SErrMsg_SectionlessEntry=Čiastočné položky nie sú povolené
SErrMsg_SectionNameMissing=Názov sekcie chýba
SErrMsg_SrcAndTranLangsAreSame=Zdroj a preklad jazykov by mal byť iný
SErrMsg_WrongSectionName=Nesprávna názov sekcie vo formáte: "%s"
SLangSourceFileFilter=DKLang jazykové zdrojové súbory (*.dklang)|*.dklang|Všetky súbory (*.*)|*.*
SMsg_NoSearchResults=Reťazec "%ce" nebol nájdený.
SMsg_PromptReplace=Nahradiť tento výskyt "%s"?
SMsg_ReplacedInfo=Nahradené %d výskyty z "%s".
SNode_Constants=Konštanty
SStatusBar_CompCount=Zlož: %d
SStatusBar_ConstCount=Konšt: %d/%d
SStatusBar_PropCount=Vlas: %d/%d
SStatusBar_ReposEntryCount=Zdroj: %d položky
STranFileFilter=DKLang prekladové súbory (*.lng)|*.lng|Všetky súbory (*.*)|*.*
STranFileFilterAnsi=DKLang Ansi prekladové súbory (*.lng)|*.lng
STranFileFilterUnicode=DKLang Unicode prekladové súbory (*.lng)|*.lng
SWarnMsg_SavingInAnsi=Chystáte sa zachrániť preklad vo formáte ANSI, zatiaľ čo jazykový zdrojový súbor používa Unicode kódovanie.\nUloženie prekladu ako ANSI môže mať za následok nesprávne znaky zobrazené v programe ktorý ste prekladali. Tak dlho, ako program používa Unicode je takmer vždy lepšie uložiť preklad aj ako Unicode.\n\nPrajete si uložiť preklad v kódovaní Unicode?
SWarnMsg_SavingInUnicode=Chystáte sa zachrániť preklad vo formáte Unicode, zatiaľ čo jazykový zdrojový súbor používa ANSI kódovanie.\nUloženie prekladu v Unicode môže zabrániť programu od možnosti jeho používania.Tak dlho, ako program používa ANSI, je takmer vždy lepšie uložiť preklad aj ako ANSI.\n\nPrajete si uložiť preklad v kódovaní ANSI?
